# 3. Задайте список из n чисел, заполненный по формуле (1 + 1/n) ** n и выведите на экран их сумму.
# Для n = 6: [2, 2, 2, 2, 2, 3] -> 13

n = int(input("Введите число N: "))
ls = list()
sum = 0
for i in range(n):
    sum = sum + round((1 + 1/(i+1)) ** (i+1))
    ls.append(round((1 + 1/(i+1)) ** (i+1)))
print("Список: ", ls)
print("Сумма чисел: ", sum)