# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь,
# ключи — первые буквы имён, значения — списки, содержащие имена,
# начинающиеся с соответствующей буквы.
# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# out
# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}

def name_sort(*list):
    letter_dict = {}
    for i in sorted(list):
        first_letter = i[0]
        if first_letter not in letter_dict:
            letter_dict[first_letter] = [i]
        else:
            letter_dict[first_letter] += [i]
    return letter_dict


my_List = ["Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"]
print(name_sort(my_List))